Revit 2024 API
RebarBendingDetailType.BendDiameterDimensionsEnabled Property
 Identifies if any radial or diameter dimensions will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool BendDiameterDimensionsEnabled { get; set; }
Visual Basic
Public Property BendDiameterDimensionsEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool BendDiameterDimensionsEnabled {
	bool get ();
	void set (bool value);
}
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace